Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: You can go into that subdirectory, make changes, add your own writable remote repository to push your changes into, fetch and merge from the original repository, and more.
cs: Můžete přejít do tohoto podadresáře, provést změny, přidat vlastní vzdálený repozitář s oprávněním k zápisu, kam budete změny odesílat, vyzvednout a začlenit data z původního repozitáře atd.

source: You can group users or repos for convenience.
cs: Pro usnadnění můžete uživatele i repozitáře sdružovat do skupin.

source: You can have Git tell you the object type of any object in Git, given its SHA-1 key, with `cat-file -t`:
cs: Zadáte-li příkaz `cat-file -t` v kombinaci s klíčem SHA-1 objektu, Git vám sdělí jeho typ, ať se jedná o jakýkoli objekt Git.

source: You can have several of them, each of which generally is either read-only or read/write for you.
cs: Vzdálených repozitářů můžete mít hned několik, každý pro vás přitom bude buď pouze ke čtení (read-only) nebo ke čtení a zápisu (read write).

source: You can insert any kind of content into it, and it will give you back a key that you can use to retrieve the content again at any time.
cs: Můžete do něj vložit jakýkoli obsah a na oplátku dostanete klíč, který můžete kdykoli v budoucnu použít k vyzvednutí obsahu.

source: You can keep all the common stuff together, like the rules for all `oss_repos` shown above, then add specific rules for specific cases later on, like so:
cs: Můžete nechat obecná nastavení, jako třeba pravidla pro všechny `oss_repos` z příkladu, a potom později přidávat pravidla pro více specifické případy. Například:

source: You can keep doing this for several levels of stability.
cs: Tento postup lze použít hned pro několik úrovní stability.

source: You can keep the changes there for minutes, days, or months, and merge them in when they’re ready, regardless of the order in which they were created or worked on.
cs: Změny tu můžete uchovávat několik minut, dní i měsíců a začlenit je přesně ve vhodnou chvíli. Na pořadí, v jakém byly větve vytvořeny nebo vyvíjeny, nezáleží.

source: You can look into the packfile and see what Git did to save space.
cs: Do balíčkového souboru můžete ostatně nahlédnout a přesvědčit se, čím Git ušetřil místo.

source: You can make Git read and write to this file by passing the `--global` option.
cs: Git bude načítat a zapisovat výhradně do tohoto souboru, jestliže zadáte parametr `--global`.

source: You can make Git read and write to this file specifically by passing the `--global` option.
cs: Čtení a zápis do tohoto souboru zajistíte zadáním parametru `--global`.

source: You can make a lightweight tag by running something like this:
cs: Prostou značku lze vytvořit spuštěním například tohoto příkazu:

source: You can make your first push to the new `iphone_project` project by adding your server as a remote to your local version of the project and pushing.
cs: Do nového projektu `iphone_project` teď můžete odeslat svá první data: přidejte do lokální verze projektu svůj server jako vzdálený repozitář a odešlete změny.

source: You can modify that message with details about how you resolved the merge if you think it would be helpful to others looking at this merge in the future — why you did what you did, if it’s not obvious.
cs: Pokud myslíte, že to může být pro spolupracovníky, kteří si jednou budou toto sloučení prohlížet, užitečné, můžete tuto zprávu upravit a doplnit o podrobnosti, jak jste sloučení vyřešili – pokud to není zřejmé, můžete okomentovat, co jste udělali a proč právě takto.

source: You can modify these limits with the `gc.auto` and `gc.autopacklimit` config settings, respectively.
cs: Tyto hodnoty můžete změnit podle svých potřeb v konfiguračním nastavení `gc.auto` a `gc.autopacklimit`.

source: You can name this file `expand_date` and put it in your path.
cs: Tento soubor můžete pojmenovat `expand_date` a vložit ho do svého umístění.

source: You can now sync this project to your local machine by calling `svnsync init` with the to and from repositories.
cs: Nyní můžete tento projekt synchronizovat na svůj lokální počítač zadáním příkazu `svnsync init` s uvedením repozitářů „do“ a „z“.

source: You can obviously refer to a commit by the SHA-1 hash that it’s given, but there are more human-friendly ways to refer to commits as well.
cs: Revizi můžete samozřejmě specifikovat na základě otisku SHA-1, jenž jí byl přidělen. Existují však i uživatelsky příjemnější způsoby, jak označit konkrétní revizi.

source: You can override that by specifying the `+` in front of the refspec.
cs: Odmítnutí serveru můžete potlačit zadáním znaku `+` před vzorec refspec.

source: You can pass files, directories, and file-glob patterns to the `git rm` command.
cs: Příkaz `git rm` lze používat v kombinaci se soubory, adresáři a maskami souborů.

source: You can pretty easily see what files have been modified in a single commit with the `--name-only` option to the `git log` command (mentioned briefly in Chapter 2):
cs: Zjistit, které soubory byly v jedné revizi změněny, lze velmi snadno pomocí příkazu `git log` s parametrem `--name-only` (stručně popsáno v kapitole 2):

source: You can provide this file to `git svn` to help it map the author data more accurately.
cs: Tento soubor můžete dát k dispozici nástroji `git svn`, aby mohl přesněji zmapovat informace o autorech.

source: You can pull the content back out of Git with the `cat-file` command.
cs: Obsah můžete ze systému Git zase vytáhnout, k tomu slouží příkaz `cat-file`.

source: You can put patterns in your project’s `.gitignore` file to have Git not see them as untracked files or try to stage them when you run `git add` on them, as discussed in Chapter 2.
cs: Do souboru `.gitignore` ve svém projektu můžete vložit masky souborů, které Git neuvidí jakožto nesledované soubory ani se je nepokusí připravit k zapsání, až na ně spustíte příkaz `git add`, jak jsme popisovali v kapitole 2.

source: You can read the value of your HEAD via this command:
cs: Hodnotu souboru HEAD můžete načíst tímto příkazem:

source: You can read trees into your staging area by calling `read-tree`.
cs: Stromy můžete do oblasti připravených změn načíst příkazem `read-tree`.

source: You can reapply the one you just stashed by using the command shown in the help output of the original stash command: `git stash apply`.
cs: Naposledy odložené soubory můžete znovu aplikovat příkazem, který byl uveden už v nápovědě ve výstupu původního příkazu stash: `git stash apply`.

source: You can rebase the server branch onto the master branch without having to check it out first by running `git rebase [basebranch] [topicbranch]` — which checks out the topic branch (in this case, `server`) for you and replays it onto the base branch (`master`):
cs: Větev server můžete přeskládat na hlavní větev příkazem `git rebase [základna] [tematická větev]`. Příkaz provede checkout tematické větve (v tomto případě větve `server`) a přeskládá její změny na základnu (angl. base branch, v tomto případě `master`):

source: You can recover it the same way, by adding a branch that points to that SHA.
cs: Nyní ji můžete obnovit stejným způsobem: přidejte novou větev, která bude ukazovat na její SHA.

source: You can remove the `client` and `server` branches because all the work is integrated and you don’t need them anymore, leaving your history for this entire process looking like Figure 3-35:
cs: Poté můžete větev `client` i `server` smazat, protože všechna práce z nich je integrována a tyto větve už nebudete potřebovat. Vaše historie pak bude vypadat jako na obrázku 3-35:

source: You can remove these comments and type your commit message, or you can leave them there to help you remember what you’re committing.
cs: Tyto komentáře můžete odstranit a napsat vlastní zprávu k revizi, nebo je můžete v souboru ponechat, abyste si lépe vzpomněli, co bylo obsahem dané revize.

source: You can run `git status` again to verify that all conflicts have been resolved:
cs: Ještě jednou můžete spustit příkaz `git status`, abyste si ověřili, že byly všechny konflikty vyřešeny:

source: You can run `git svn fetch` to grab the new data, but `git svn rebase` does the fetch and then updates your local commits.
cs: Nová data sice můžete vyzvednout i příkazem `git svn fetch`, avšak příkaz `git svn rebase` data nejen stáhne, ale navíc aktualizuje vaše lokální revize.

source: You can run auto gc manually as follows:
cs: Příkaz auto gc můžete spustit také ručně:

source: You can run rebase interactively by adding the `-i` option to `git rebase`.
cs: Interaktivní režim přeskládání spustíte příkazem `git rebase` s parametrem `-i`.

source: You can run something like `git log 1a410e` to look through your whole history, but you still have to remember that `1a410e` is the last commit in order to walk that history to find all those objects.
cs: Chcete-li si prohlédnout celou svou historii, můžete zadat příkaz `git log 1a410e`. Problém je v tom, že si k prohlížení historie a nalezení objektů stále ještě musíte pamatovat, že poslední revizí byla `1a410e`.

source: You can run tests or otherwise inspect the working tree with this script.
cs: Tímto skriptem lze spouštět různé testy nebo jinak kontrolovat pracovní strom.

source: You can run the `count-objects` command to quickly see how much space you’re using:
cs: Chcete-li rychle zjistit, kolik místa je obsazeno, můžete použít příkaz `count-objects`:

source: You can run via SSH in the same manner as the `receive-pack` process.
cs: Můžete ho spustit prostřednictvím SSH stejným způsobem jako proces `receive-pack`.

source: You can run your tests, make sure the hotfix is what you want, and merge it back into your master branch to deploy to production.
cs: Můžete spustit testy, abyste se ujistili, že hotfix splňuje všechny požadavky, a pak můžete větev začlenit (merge) zpět do hlavní větve, aby byla připravena do produkce.

source: You can save a stash on one branch, switch to another branch later, and try to reapply the changes.
cs: Odklad můžete uložit na jedné větvi, později přepnout na jinou větev a aplikovat změny tam.

source: You can see Chapter 9 for more information about plumbing tools; basically, `rev-parse` exists for lower-level operations and isn’t designed to be used in day-to-day operations.
cs: Více o nízkoúrovňových nástrojích najdete v kapitole 9. Nástroj `rev-parse` se používá v podstatě pouze pro operace na nižších úrovních a není koncipován pro každodenní používání.

source: You can see GitWeb in use at sites like `http://git.kernel.org` (see Figure 4-1).
cs: V činnosti můžete GitWeb pozorovat například na stránkách `http://git.kernel.org` (viz obrázek 4-1).

source: You can see a file in the `objects` directory.
cs: Vidíte, že v adresáři `objects` přibyl nový soubor.

source: You can see from the size value that the big object is still in your loose objects, so it’s not gone; but it won’t be transferred on a push or subsequent clone, which is what is important.
cs: Podle hodnoty velikosti je vidět, že se velký objekt stále ještě nachází mezi volnými objekty, a nebyl tedy odstraněn. Nebude ale součástí přenášených dat při odesílání nebo následném klonování, což je pro nás rozhodující.

source: You can see how powerful this technique can be for customized applications.
cs: Zde vidíte, jak může být tato metoda účinná pro uživatelsky nastavené aplikace.

source: You can see that Git re-modifies the files you uncommitted when you saved the stash.
cs: Jak vidíte, Git se pokusí obnovit změněné soubory, které jste nezapsali a uložili při odkladu.

source: You can see that it applied cleanly and automatically created the new commit for you.
cs: Jak vidíte, záplata byla aplikována čistě a automaticky byla vytvořena nová revize.

source: You can see that the changes have been reverted.
cs: Jak vidíte, změny byly zahozeny.

source: You can see that the commit has given you some output about itself: which branch you committed to (`master`), what SHA-1 checksum the commit has (`463dc4f`), how many files were changed, and statistics about lines added and removed in the commit.
cs: Vidíte, že se po zapsání revize zobrazil výpis s informacemi: do jaké větve jste revizi zapsali (`master`), jaký je kontrolní součet SHA-1 revize (`463dc4f`), kolik souborů bylo změněno a statistiku přidaných a odstraněných řádků revize.

source: You can see that the default commit message contains the latest output of the `git status` command commented out and one empty line on top.
cs: Jak vidíte, výchozí zpráva k revizi (commit message) obsahuje zakomentovaný aktuální výstup příkazu `git status` a nahoře jeden prázdný řádek.

source: You can see that this command shows you a much different view of your staging area — basically the same information you get with `git status` but a bit more succinct and informative.
cs: Vidíte, že tento příkaz vám poskytne podstatně odlišný pohled na vaši oblast připravených změn. Stejné informace, i když o něco stručnější a hutnější, získáte také příkazem `git status`.

source: You can see that your new `README` file is untracked, because it’s under the “Untracked files” heading in your status output.
cs: Vidíte, že nový soubor `README` není sledován, protože je ve výpisu stavů uveden v části „Untracked files“.

source: You can see that you’ve tagged the commit:
cs: Můžete se podívat, že jste revizi označil:

source: You can see the `git-p4` identifier in each commit.
cs: V každé revizi si můžete všimnout identifikátoru `git-p4`.

source: You can see the added word enclosed in `{+ +}` and removed one enclosed in `[- -]`.
cs: Přidaná slova jsou uzavřena mezi značkami `{+ +}` a odstraněná jsou uzavřena v `[- -]`.

source: You can see the commit history in the top half of the window along with a nice ancestry graph.
cs: V horní polovině okna vidíte historii revizí, doplněnou názorným hierarchickým grafem.

source: You can see the tag data along with the commit that was tagged by using the `git show` command:
cs: Informace značky se zobrazí spolu s revizí, kterou značka označuje, po zadání příkazu `git show`:

source: You can see this by creating an annotated tag (`-a` specifies that it’s an annotated tag):
cs: To je dobře vidět, vytvoříte-li anotovanou značku (`-a` udává, že se jedná o anotovanou značku):

source: You can see where you’ve been at any time by running `git reflog`:
cs: Spuštěním příkazu `git reflog` zjistíte, kde jste se nacházeli v libovolném okamžiku:

source: You can see your reflog by using `git reflog`:
cs: Svůj reflog si můžete nechat zobrazit příkazem `git reflog`:

source: You can set each value separately with a series of `git config` commands, or you can add them manually; but in the end, your config file should look something like this:
cs: Každou hodnotu můžete nastavit zvlášť pomocí série příkazů `git config` nebo můžete vložit hodnoty ručně. Na konci by ale měl váš soubor config vypadat přibližně takto:

source: You can set it to `more` or to your favorite pager (by default, it’s `less`), or you can turn it off by setting it to a blank string:
cs: Můžete jej nastavit na `more` nebo na nějaký jiný oblíbený (výchozím stránkovačem je `less`). Můžete jej také vypnout zadáním prázdného řetězce:

source: You can set it up by setting the filter attribute in your `.gitattributes` file to filter `*.c` files with the "indent" filter:
cs: V souboru `.gitattributes` můžeme nastavit atribut `filter` tak, aby se soubory `*.c` zpracovaly filtrem `indent`:

source: You can set the color to any of the following values: `normal`, `black`, `red`, `green`, `yellow`, `blue`, `magenta`, `cyan`, or `white`, or, if your terminal supports more than 16 colors, an arbitrary numeric color value (between 0 and 255 on a 256-color terminal).
cs: U barev lze zadávat tyto hodnoty: `normal` (normální), `black` (černá), `red` (červená), `green` (zelená), `yellow` (žlutá), `blue` (modrá), `magenta` (purpurová), `cyan` (azurová) nebo `white` (bílá).

source: You can set up an attribute like this:
cs: V tom případě můžete nastavit tento atribut:

source: You can set up three client-side hooks for an e-mail-based workflow.
cs: Pro pracovní postup založený na e-mailové komunikaci lze nastavit tři zásuvné moduly na straně klienta.

source: You can set up your new repository by copying your bare repository over:
cs: Nový repozitář můžete nastavit zkopírováním holého repozitáře příkazem:

source: You can set your merge tool to kdiff3, opendiff, tkdiff, meld, xxdiff, emerge, vimdiff, or gvimdiff.
cs: Jako nástroj slučování můžete nastavit kdiff3, opendiff, tkdiff, meld, xxdiff, emerge, vimdiff nebo gvimdiff.

source: You can start up interactive Ruby mode with the `irb` command:
cs: Interaktivní režim Ruby spustíte příkazem `irb`:

source: You can take that output, loop through each of those commit SHAs, grab the message for it, and test that message against a regular expression that looks for a pattern.
cs: Tento výstup můžete vzít, projít všechny hodnoty SHA jednotlivých revizí, vzít jejich zprávy a otestovat je proti regulárnímu výrazu, který vyhledává vzor.

source: You can take the changes on client that aren’t on server (C8 and C9) and replay them on your master branch by using the `--onto` option of `git rebase`:
cs: Můžete vzít změny na větvi client, které nejsou na větvi server (C8 a C9), a nechat je znovu provést na hlavní větvi. Použijte k tomu příkaz `git rebase` v kombinaci s parametrem `--onto`:

source: You can tell Git not to export certain files or directories when generating an archive.
cs: Systému Git můžete zadat, aby při generování archivu neexportoval určité soubory nebo adresáře.

source: You can tell Git to convert CRLF to LF on commit but not the other way around by setting `core.autocrlf` to input:
cs: Systému Git tak můžete zadat, aby převáděl posloupnosti CRLF na LF (avšak nikoli obráceně) nastavením `core.autocrlf` na hodnotu input:

source: You can tell Git to pack references into that file by using the `git pack-refs` command.
cs: K zabalení referencí do tohoto souboru můžeme Git vyzvat příkazem `git pack-refs`.

source: You can tell Git which of these you want enabled by setting `core.whitespace` to the values you want on or off, separated by commas.
cs: Které z těchto funkcí si přejete zapnout a které vypnout, to můžete systému Git sdělit zadáním čárkami oddělených hodnot do parametru `core.whitespace`.

source: You can tell Gitolite:
cs: Nástroji Gitolite můžeme říct:

source: You can tell that it’s staged because it’s under the “Changes to be committed” heading.
cs: Můžeme říci, že je připraven k zapsání, protože je uveden v části „Changes to be committed“, tedy „Změny k zapsání“.

source: You can then check how big is that object on your disk:
cs: Pomocí příkazu git cat-file zjistíte aktuální velikost objektu:

source: You can then clone the code by running
cs: Zdrojový kód pak naklonujete příkazem

source: You can then run this program and pipe its output through `git fast-import`.
cs: Tento program můžete spustit a jeho výstup nechat zpracovat příkazem `git fast-import`.

source: You can think of the data that Git contains for these structures as being like Figure 9-2.
cs: Data, která Git pro tyto struktury obsahuje, si můžete představit jako ilustraci na obrázku 9-2.

source: You can throw away the original `iss91` branch (losing commits C5 and C6) and merge in the other two.
cs: Původní větev `iss91` tak nyní můžete zahodit (s ní i revize C5 a C6) a začlenit zbylé dvě větve.

source: You can treat the `rack` directory as a separate project and then update your superproject from time to time with a pointer to the latest commit in that subproject.
cs: S adresářem `rack` můžete pracovat jako se samostatným projektem a čas od času aktualizovat superprojekt ukazatelem na nejnovější revizi v tomto subprojektu.

source: You can turn on this functionality with the `core.autocrlf` setting.
cs: Tato funkce se zapíná pomocí parametru `core.autocrlf`.

source: You can use `git filter-branch` to remove the identifier strings en masse:
cs: K odstranění všech řetězců identifikátoru najednou můžete použít příkaz `git filter-branch`:

source: You can use `git merge -s subtree` and it will work fine; but Git will also merge the histories together, which you probably don’t want.
cs: Můžete použít příkaz `git merge -s subtree` a začlenění proběhne úspěšně. Git však sloučí také obě historie, což pravděpodobně nebylo vaším záměrem.

source: You can use it to notify a group or the author of the patch you pulled in that you’ve done so.
cs: Můžete ho použít k tomu, abyste skupině uživatelů nebo autorovi záplaty oznámili, že byla záplata natažena.

source: You can use it to restore data in the working tree that Git can’t track, such as permissions data.
cs: Pomocí něj můžete obnovit data v pracovním stromě, které Git neumí sledovat, např. data oprávnění.

source: You can use that incantation to grab the commit message from each commit that is trying to be pushed and exit if you see anything that doesn’t match.
cs: Tento výraz můžete použít k extrakci zpráv ze všech odesílaných revizí a skript ukončit, jestliže najdete něco, co neodpovídá požadavkům.

source: You can use the Git plumbing command `show-ref` to look at all your full reference names:
cs: Pokud si přejete zobrazit všechny své reference s úplným názvem, můžete použít nízkoúrovňový příkaz `show-ref`:

source: You can use these hooks for all sorts of reasons, and you’ll learn about a few of them here.
cs: Zásuvné moduly se dají využívat k různým účelům. V krátkosti si tu některé z nich představíme.

source: You can use this hook to disallow rebasing any commits that have already been pushed.
cs: Zásuvný modul můžete využít i k zakázání přeskládání všech revizí, které už byly odeslány.

source: You can use this hook to do things like make sure none of the updated references are non-fast-forwards; or to check that the user doing the pushing has create, delete, or push access or access to push updates to all the files they’re modifying with the push.
cs: Zásuvný modul můžete využít např. k ověření, že všechny aktualizované reference jsou „rychle vpřed“, nebo ke kontrole, že uživatel odesílající revize má oprávnění k vytváření, mazání nebo odesílání nebo oprávnění aktualizovat všechny soubory, které svými revizemi mění.

source: You can use this to find your blob’s name:
cs: Tuto kombinaci můžete použít k nalezení názvu hledaného blobu:

source: You can use this to make sure a commit message is properly formatted or to normalize the message by having the script edit it in place.
cs: Zásuvný modul můžete použít k ujištění, že je zpráva k revizi ve správném formátu, nebo ke standardizaci zprávy – skript může zprávu rovnou upravit.

source: You can view the public key by running
cs: Veřejný klíč můžete zobrazit příkazem

source: You can write this example pretty easily in anything you’re familiar with — it just needs to print the appropriate information to stdout.
cs: Tento příklad můžete ale beze všeho napsat v čemkoli, co vám vyhovuje. Jedinou podmínkou je, aby byly potřebné informace zapsány na standardní výstup (stdout).

source: You can zlib-uncompress it, strip off the header, and look at the commit content:
cs: Objekt můžete rozbalit, extrahovat záhlaví a prohlédnout si obsah revize:

source: You can’t directly compare two versions unless you check them out and scan them manually, right?
cs: Srovnávat dvě verze přímo nelze, můžete je tak nanejvýš otevřít a ručně je projít, že?

source: You can’t lose information in transit or get file corruption without Git being able to detect it.
cs: Nemůže tak dojít ke ztrátě informací při přenosu dat nebo k poškození souboru, aniž by to byl Git schopen zjistit.

source: You can’t record a submodule at `master` or some other symbolic reference.
cs: Submodul nelze zaznamenat na větvi `master` nebo na jiné symbolické referenci.
